{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Алфавит - 1 (old)\n",
    "\n",
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t64Mb  \n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Вася пишет программу, автоматически определяющую язык запроса пользователя в поисковую систему. У Васи есть алфавиты известных ему языков. Помогите Васе для каждого запроса определить, к каким языкам он может относиться, если смотреть только на алфавит. Запрос может относиться к языку, если в нем есть хотя бы один символ из алфавита этого языка.\n",
    "\n",
    "Формат ввода  \n",
    "Сначала задано число L - количество языков. Далее идет L пар строк. Первая строка в паре - название языка. Вторая строка - алфавит языка. Далее идет N - число запросов. Потому идут сами запросы. Длина всех строк не превосходит 200.\n",
    "\n",
    "Формат вывода  \n",
    "Для каждого запроса на отдельной строке выведите черех пробел возможные языки запроса в лексикографическом порядке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "lang = int(input())\n",
    "dicts = {}\n",
    "\n",
    "for i in range(lang):\n",
    "    l = input()\n",
    "    dicts[l] = set(input())\n",
    "\n",
    "query = int(input())\n",
    "\n",
    "for i in range(query):\n",
    "    q = set(input())\n",
    "    res = []\n",
    "    for k in dicts:\n",
    "        if bool(q&dicts[k]):\n",
    "            res.append(k)\n",
    "    res.sort()\n",
    "    print(*res)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
