{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t64Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Вася решил избавиться от проблем с произношением и стать певцом. Он обратился за помощью к логопеду. Тот посоветовал Васе выполнять упражнение, которое называется анаграммная группировка. В качестве подготовительного этапа нужно выбрать из множества строк анаграммы.\n",
    "\n",
    "Анаграммы –— это строки, которые получаются друг из друга перестановкой символов. Например, строки «SILENT» и «LISTEN» являются анаграммами.\n",
    "\n",
    "Помогите Васе найти анаграммы.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке записано число n —– количество строк. Далее в строку через пробел записаны n строк. n не превосходит 6000. Длина каждой строки не более 100 символов.\n",
    "\n",
    "Формат вывода  \n",
    "Нужно вывести в отсортированном порядке индексы строк, которые являются анаграммами.\n",
    "\n",
    "Каждая группа индексов должна быть выведена в отдельной строке. Индексы внутри одной группы должны быть отсортированы по возрастанию. Группы между собой должны быть отсортированы по возрастанию первого индекса.\n",
    "\n",
    "Обратите внимание, что группа анаграмм может состоять и из одной строки. Например, если в исходном наборе нет анаграмм, то надо вывести n групп, каждая из которых состоит из одного индекса."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "counter: int = int(input())\n",
    "s: list[str] = input().split()\n",
    "\n",
    "def hash(s: str) -> int:\n",
    "    hash = 0\n",
    "    for i in s:  \n",
    "        hash += (ord(i)*7*13%1009)**3\n",
    "    return hash\n",
    "\n",
    "hash_map: dict[int, list[int]] = {}\n",
    "\n",
    "for i in range(counter):\n",
    "    value = hash(s[i])\n",
    "    map_value = hash_map.get(value, [])\n",
    "    map_value.append(i)\n",
    "    hash_map[value] = map_value\n",
    "\n",
    "for i in sorted(hash_map.values()):\n",
    "    print(*i)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
