{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Банковские счета\n",
    "\n",
    "Некоторый банк хочет внедрить систему управления счетами клиентов, поддерживающую следующие операции:\n",
    "\n",
    "Пополнение счета клиента. Снятие денег со счета. Запрос остатка средств на счете. Перевод денег между счетами клиентов. Начисление процентов всем клиентам.\n",
    "\n",
    "Вам необходимо реализовать такую систему. Клиенты банка идентифицируются именами (уникальная строка, не содержащая пробелов). Первоначально у банка нет ни одного клиента. Как только для клиента проводится операция пололнения, снятия или перевода денег, ему заводится счет с нулевым балансом. Все дальнейшие операции проводятся только с этим счетом. Сумма на счету может быть как положительной, так и отрицательной, при этом всегда является целым числом.\n",
    "\n",
    "Формат ввода  \n",
    "Входной файл содержит последовательность операций. Возможны следующие операции: DEPOSIT name sum - зачислить сумму sum на счет клиента name. Если у клиента нет счета, то счет создается. WITHDRAW name sum - снять сумму sum со счета клиента name. Если у клиента нет счета, то счет создается. BALANCE name - узнать остаток средств на счету клиента name. TRANSFER name1 name2 sum - перевести сумму sum со счета клиента name1 на счет клиента name2. Если у какого-либо клиента нет счета, то ему создается счет. INCOME p - начислить всем клиентам, у которых открыты счета, p% от суммы счета. Проценты начисляются только клиентам с положительным остатком на счету, если у клиента остаток отрицательный, то его счет не меняется. После начисления процентов сумма на счету остается целой, то есть начисляется только целое число денежных единиц. Дробная часть начисленных процентов отбрасывается.\n",
    "\n",
    "Формат вывода  \n",
    "Для каждого запроса BALANCE программа должна вывести остаток на счету данного клиента. Если же у клиента с запрашиваемым именем не открыт счет в банке, выведите ERROR."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "balances = {}\n",
    "file = open(\"input.txt\", \"r\", encoding='utf-8')\n",
    "x = file.readlines()\n",
    "for line in x:\n",
    "    y = line.split()\n",
    "    if y[0] == 'BALANCE':\n",
    "        print(balances.get(y[1], 'ERROR'))\n",
    "    if y[0] == 'DEPOSIT':\n",
    "        balances[y[1]] = balances.setdefault(y[1], 0) + int(y[2])\n",
    "    if y[0] == 'INCOME':\n",
    "        for i in balances.keys():\n",
    "            if int(balances.get(i)) > 0:\n",
    "                balances[i] = int(balances.get(i) * (int(y[1])/100 + 1))\n",
    "    if y[0] == 'WITHDRAW':\n",
    "        balances[y[1]] = balances.setdefault(y[1], 0) - int(y[2])\n",
    "    if y[0] == 'TRANSFER':\n",
    "        balances[y[1]] = balances.setdefault(y[1], 0) - int(y[3])\n",
    "        balances[y[2]] = balances.setdefault(y[2], 0) + int(y[3])"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
