{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Жизнь в квадрате\n",
    "\n",
    "В некоторых клетках квадрата N x N живут микроорганизмы (не более одного в одной клетке). Каждую секунду происходит следующее:\n",
    "\n",
    "– все микроорганизмы, у которых менее 2-х соседей, умирают от скуки (соседями называются микроорганизмы, живущие в клетках, имеющих общую сторону или вершину);\n",
    "– все микроорганизмы, у которых более 3-х соседей, умирают от перенаселенности;\n",
    "– в клетках, у которых ровно 2 соседа ничего не меняется;\n",
    "– на всех пустых клетках, у которых ровно в трех соседних клетках жили микроорганизмы, появляются новые микроорганизмы.\n",
    "\n",
    "Все изменения происходят одновременно, то есть для каждой клетки сначала выясняется ее судьба, а затем происходят изменения сразу во всех клетках. Требуется по данной конфигурации определить, во что она превратится через T секунд.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке вводятся два натуральных числа – N (1 ≤ N ≤ 10) и T (1 ≤ T ≤ 100).\n",
    "\n",
    "Далее записано N строчек по N чисел, описывающих начальную конфигурацию (0 – пустая клетка, 1 – микроорганизм). Числа в строках разделены пробелами.\n",
    "\n",
    "Формат вывода  \n",
    "Требуется вывести N строк по N чисел – описание конфигурации через T секунд (в том же формате, как и во входных данных)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n, t = map(int, input().split())\n",
    "tbl = [[0] * (n + 2)] + [[0] + list(map(int, input().split())) + [0] for _ in range(n)] + [[0] * (n + 2)]\n",
    "for _ in range(t):\n",
    "  tmp = [[0 for _ in range(n + 2)] for _ in range(n + 2)]\n",
    "  for i in range(1, n + 1):\n",
    "    for j in range(1, n + 1):\n",
    "      s = sum([sum(k[j - 1 : j + 2]) for k in tbl[i - 1 : i + 2]]) - tbl[i][j]\n",
    "      if s == 3 : tmp[i][j] = 1\n",
    "      elif s == 2: tmp[i][j] = tbl[i][j]\n",
    "  tbl = tmp\n",
    "for i in range(1, n + 1): \n",
    "    print(*tbl[i][1 : n + 1])"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
