{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Забастовки\n",
    "\n",
    "Политическая жизнь одной страны очень оживленная. В стране действует K политических партий, каждая из которых регулярно объявляет национальную забастовку. Дни, когда хотя бы одна из партий объявляет забастовку, при условии, что это не суббота или воскресенье (когда и так никто не работает), наносят большой ущерб экономике страны. i-я партия объявляет забастовки строго каждые bi дней, начиная с дня с номером ai. То есть i-я партия объявляет забастовки в дни ai, ai+bi, ai+2bi и т.д. Если в какой-то день несколько партий объявляет забастовку, то это считается одной общенациональной забастовкой. В календаре страны N дней, пронумерованных от 1 до N. Первый день года является понедельником, шестой и седьмой дни года — выходные, неделя состоит из семи дней.\n",
    "\n",
    "Формат ввода  \n",
    "Программа получает на вход число дней в году N (1≤ N≤106) и число политических партий K (1≤ K≤100). Далее идет K строк, описывающие графики проведения забастовок. i-я строка содержит числа ai и bi (1≤ ai, bi≤ N).\n",
    "\n",
    "Формат вывода  \n",
    "Выведите единственное число: количество забастовок, произошедших в течение года."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "d, parties = map(int, input().split())\n",
    "days = list(range(1, d+1))\n",
    "\n",
    "def null_weekends(begin, step):\n",
    "    for i in range(begin-1, d, step):\n",
    "        days[i] = 0\n",
    "\n",
    "def null_days(begin, step):\n",
    "    for i in range(begin-1, d, step):\n",
    "        if days[i] == 0:\n",
    "            continue\n",
    "        else:\n",
    "            days[i] = 'b'\n",
    "\n",
    "null_weekends(6, 7)\n",
    "null_weekends(7, 7)\n",
    "\n",
    "while parties != 0:\n",
    "    begin, step = map(int, input().split())\n",
    "    null_days(begin, step)\n",
    "    parties -= 1\n",
    "\n",
    "print(days.count('b'))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
