{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Замена слов\n",
    "\n",
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t64Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "С целью экономии чернил в картридже принтера было принято решение укоротить некоторые слова в тексте. Для этого был составлен словарь слов, до которых можно сокращать более длинные слова. Слово из текста можно сократить, если в словаре найдется слово, являющееся началом слова из текста. Например, если в списке есть слово \"лом\", то слова из текста \"ломбард\", \"ломоносов\" и другие слова, начинающиеся на \"лом\", можно сократить до \"лом\".\n",
    "\n",
    "Если слово из текста можно сократить до нескольких слов из словаря, то следует сокращать его до самого короткого слова.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке через пробел вводятся слова из словаря, слова состоят из маленьких латинских букв. Гарантируется, что словарь не пуст и количество слов в словаре не превышет 1000, а длина слов — 100 символов.\n",
    "\n",
    "Во второй строке через пробел вводятся слова текста (они также состоят только из маленьких латинских букв). Количество слов в тексте не превосходит 105, а суммарное количество букв в них — 106.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите текст, в котором осуществлены замены."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "dictionary = input().split()\n",
    "text = input().split()\n",
    "\n",
    "def short_text(text, dictionary):\n",
    "    dictionary.sort(key=lambda x: (len(x), x))\n",
    "    for i in range(len(text)):\n",
    "        for j in dictionary:\n",
    "            if len(text[i]) <= len(j):\n",
    "                break\n",
    "            if text[i].startswith(j):\n",
    "                text[i] = j\n",
    "                break\n",
    "    return ' '.join(text)\n",
    "\n",
    "print(short_text(text, dictionary))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
