{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Игра с заменами\n",
    "\n",
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t256Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Вася придумал игру для умного телевизора: можно сколько угодно раз выбрать две произвольные буквы латинского алфавита и заменить в строке все вхождения первой буквы на вторую, а второй — на первую. Так при выборе буквы a и b строка abc превратится в bac. Если выбрать буквы a и x, то строка abc превратится в строку xbc. Цель игры состоит в том, чтобы получить из строки s1 строку s2.\n",
    "\n",
    "К сожалению, Вася умеет только генерировать гениальные идеи, но не программировать. Он придумал много пар строк s1 и s2. Для каждой пары определите, возможно ли получить из строки s1 строку s2 по правилам игры.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке задано число t (1 ≤ t ≤ 100) — количество пар строк, придуманных Васей. В следующих 2t строках вводятся t пар слов равной длины, разделенных переводом строки и состоящих из строчных латинских букв — s1 и s2 соответственно.\n",
    "\n",
    "Гарантируется, что суммарная длина всех слов не превосходит 105 символов.\n",
    "\n",
    "Формат вывода  \n",
    "Для каждой пары слов выведите YES, если из s1 можно получить s2 по правилам игры и NO в противном случае."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "counter = int(input())\n",
    "\n",
    "def check_string_pare(s1, s2):\n",
    "    mapping1 = {}\n",
    "    mapping2 = {}\n",
    "    for i in range(len(s1)):\n",
    "        if s1[i] in mapping1 and mapping1[s1[i]] != s2[i]:\n",
    "            return 'NO'\n",
    "        elif s2[i] in mapping2 and mapping2[s2[i]] != s1[i]:\n",
    "            return 'NO'\n",
    "        else:\n",
    "            mapping1[s1[i]] = s2[i]\n",
    "            mapping2[s2[i]] = s1[i]\n",
    "    else:\n",
    "        return 'YES'\n",
    "\n",
    "\n",
    "for i in range(counter):\n",
    "    s1 = input()\n",
    "    s2 = input()\n",
    "    print(check_string_pare(s1, s2))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
