{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t64Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Задание связано с обратной польской нотацией. Она используется для парсинга арифметических выражений. Еще её иногда называют постфиксной нотацией.\n",
    "\n",
    "В постфиксной нотации операнды расположены перед знаками операций.\n",
    "\n",
    "Пример 1:\n",
    "3 4 +\n",
    "означает 3 + 4 и равно 7\n",
    "\n",
    "Пример 2:\n",
    "12 5 /\n",
    "Так как деление целочисленное, то в результате получим 2.\n",
    "\n",
    "Пример 3:\n",
    "10 2 4 * -\n",
    "означает 10 - 2 * 4 и равно 2\n",
    "\n",
    "Разберём последний пример подробнее:\n",
    "\n",
    "Знак * стоит сразу после чисел 2 и 4, значит к ним нужно применить операцию, которую этот знак обозначает, то есть перемножить эти два числа. В результате получим 8.\n",
    "\n",
    "После этого выражение приобретёт вид:\n",
    "\n",
    "10 8 -\n",
    "\n",
    "Операцию «минус» нужно применить к двум идущим перед ней числам, то есть 10 и 8. В итоге получаем 2.\n",
    "\n",
    "Рассмотрим алгоритм более подробно. Для его реализации будем использовать стек.\n",
    "\n",
    "Для вычисления значения выражения, записанного в обратной польской нотации, нужно считывать выражение слева направо и придерживаться следующих шагов:\n",
    "\n",
    "Обработка входного символа:  \n",
    "1. Если на вход подан операнд, он помещается на вершину стека.\n",
    "2. Если на вход подан знак операции, то эта операция выполняется над требуемым количеством значений, взятых из стека в порядке добавления. Результат выполненной операции помещается на вершину стека.\n",
    "3. Если входной набор символов обработан не полностью, перейти к шагу 1.\n",
    "\n",
    "После полной обработки входного набора символов результат вычисления выражения находится в вершине стека. Если в стеке осталось несколько чисел, то надо вывести только верхний элемент.\n",
    "\n",
    "Замечание про отрицательные числа и деление: в этой задаче под делением понимается математическое целочисленное деление. Это значит, что округление всегда происходит вниз. А именно: если a / b = c, то b ⋅ c — это наибольшее число, которое не превосходит a и одновременно делится без остатка на b.\n",
    "\n",
    "В текущей задаче гарантируется, что деления на отрицательное число нет.\n",
    "\n",
    "Формат ввода  \n",
    "В единственной строке дано выражение, записанное в обратной польской нотации. Числа и арифметические операции записаны через пробел.\n",
    "\n",
    "На вход могут подаваться операции: +, -, *, / и числа, по модулю не превосходящие 10000.\n",
    "\n",
    "Гарантируется, что значение промежуточных выражений в тестовых данных по модулю не больше 50000.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите единственное число — значение выражения."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import operator\n",
    "\n",
    "\n",
    "class Stack:\n",
    "    \"\"\"Класс стэка.\"\"\"\n",
    "    def __init__(self):\n",
    "        self.items = []\n",
    "\n",
    "    def push(self, item: int) -> None:\n",
    "        \"\"\"Добавить элемент на вершину стэка.\"\"\"\n",
    "        self.items.append(item)\n",
    "\n",
    "    def pop(self) -> int:\n",
    "        \"\"\"Убрать элемент с вершины стэка.\"\"\"\n",
    "        return self.items.pop()\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    operators = {\n",
    "        '+': operator.add,\n",
    "        '-': operator.sub,\n",
    "        '*': operator.mul,\n",
    "        '/': operator.floordiv,\n",
    "    }\n",
    "    input_expression = input().split()\n",
    "    stack = Stack()\n",
    "\n",
    "    for i in input_expression:\n",
    "        if i in operators:\n",
    "            number_2 = stack.pop()\n",
    "            number_1 = stack.pop()\n",
    "            stack.push(operators[i](number_1, number_2))\n",
    "        else:\n",
    "            stack.push(int(i))\n",
    "\n",
    "    print(stack.pop())"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "916dbcbb3f70747c44a77c7bcd40155683ae19c65e1c03b4aa3499c5328201f1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
