{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Канонический путь\n",
    "\n",
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t64Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "По заданной строке, являющейся абсолютным адресом в Unix-системе, вам необходимо получить канонический адрес.\n",
    "\n",
    "В Unix-системе \".\" соответсвутет текущей директории, \"..\" — родительской директории, при этом будем считать, что любое количество точек подряд, большее двух, соответствует директории с таким названием (состоящем из точек). \"/\" является разделителем вложенных директорий, причем несколько \"/\" подряд должны интерпретироваться как один \"/\".\n",
    "\n",
    "Канонический путь должен обладать следующими свойствами:\n",
    "\n",
    "1. всегда начинаться с одного \"/\"\n",
    "2. любые две вложенные директории разделяются ровно одним знаком \"/\"\n",
    "3. путь не заканчивается \"/\" (за исключением корневой директории, состоящего только из символа \"/\")\n",
    "4. в каноническом пути есть только директории, т.е. нет ни одного вхождения \".\" или \"..\" как соответствия текущей или родительской директории\n",
    "\n",
    "Формат ввода  \n",
    "Вводится строка с абсолютным адресом, её длина не превосходит 100.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите канонический путь."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "abs_path = input().split('/')\n",
    "\n",
    "canon_path =[]\n",
    "\n",
    "for i in abs_path:\n",
    "    if not i or i == '.' or (i == '..' and not canon_path):\n",
    "        continue\n",
    "    if i == '..' and canon_path:\n",
    "        canon_path.pop()\n",
    "        continue\n",
    "    canon_path.append(i)\n",
    "\n",
    "\n",
    "print('/' + '/'.join(canon_path))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
