{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Кубики\n",
    "\n",
    "Аня и Боря любят играть в разноцветные кубики, причем у каждого из них свой набор и в каждом наборе все кубики различны по цвету. Однажды дети заинтересовались, сколько существуют цветов таких, что кубики каждого цвета присутствуют в обоих наборах. Для этого они занумеровали все цвета случайными числами. На этом их энтузиазм иссяк, поэтому вам предлагается помочь им в оставшейся части. Номер любого цвета — это целое число в пределах от 0 до 109.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке входного файла записаны числа N и M — количество кубиков у Ани и Бори соответственно. В следующих N строках заданы номера цветов кубиков Ани. В последних M строках номера цветов кубиков Бори.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите сначала количество, а затем отсортированные по возрастанию номера цветов таких, что кубики каждого цвета есть в обоих наборах, затем количество и отсортированные по возрастанию номера остальных цветов у Ани, потом количество и отсортированные по возрастанию номера остальных цветов у Бори."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n, m = map(int, input().split())\n",
    "first = []\n",
    "second = []\n",
    "while n != 0:\n",
    "    first.append(int(input()))\n",
    "    n -= 1\n",
    "while m != 0:\n",
    "    second.append(int(input()))\n",
    "    m -= 1\n",
    "first = set(first)\n",
    "second = set(second)\n",
    "x = first & second\n",
    "print(len(x))\n",
    "print(' '.join(list(map(str, sorted(x)))))\n",
    "y = first - second\n",
    "print(len(y))\n",
    "print(' '.join(list(map(str, sorted(y)))))\n",
    "z = second - first\n",
    "print(len(z))\n",
    "print(' '.join(list(map(str, sorted(z)))))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
