{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Лог без дат\n",
    "\n",
    "Ограничение времени\t2 секунды  \n",
    "Ограничение памяти\t256Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Вася решил обработать логи с сервера, но обнаружил, что из-за ошибки разработчиков для каждого события в логе записывается только время этого события в формате HH:MM:SS, а дата не записывается.  \n",
    "Известно, что все события записаны в хронологическом порядке и два события не могли произойти в одну и ту же секунду. Определите минимальное количество дней, в течение которых записывался лог.\n",
    "\n",
    "Формат ввода  \n",
    "Первая строка входных данных содержит единственное число n (1≤n≤100000) — количество событий в логе. Следующие n строк описывают времена событий. Каждая строка имеет формат HH:MM:SS, где HH — число от 0 до 23, а MM и SS — числа от 0 до 59. Все записи чисел состоят ровно из двух цифр.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите одно целое число — минимальное количество дней, в течение которых записывался лог."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def time_to_seconds(time):\n",
    "    h, m, s = time.split(':')\n",
    "    return int(h) * 3600 + int(m) * 60 + int(s)\n",
    "\n",
    "counter = int(input())\n",
    "last_log = time_to_seconds(input())\n",
    "days = 1\n",
    "\n",
    "for i in range(counter-1):\n",
    "    new_log = time_to_seconds(input())\n",
    "    if new_log <= last_log:\n",
    "        days += 1\n",
    "    last_log = new_log\n",
    "\n",
    "print(days)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
