{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ошибка\n",
    "\n",
    "Вы обслуживаете сайт и отслеживаете возникающие проблемы. Клиент получил ошибку после того, как попытался добавить свой пост в систему. Вы хотите понять, на каком из серверов эта ошибка произошла.\n",
    "\n",
    "Есть n серверов, на i-й из них приходится a процентов запросов, из которых b процентов завершаются с ошибкой. Для каждого сервера найдите вероятность того, что ошибка произошла именно на нём.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке входного файла содержится одно целое число n(1≤n≤100) — количество серверов.\n",
    "\n",
    "В каждой из следующих n строк содержится два целых числа a и b вероятность того, что запрос пойдёт на i-й сервер, в процентах и вероятность того, что на i-м сервере случится ошибка, в процентах.\n",
    "\n",
    "Гарантируется, что сумма всех a равна 100, и ошибка в системе может произойти.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите n строк. В каждой строке должно находиться одно вещественное число вероятность, что ошибка произошла на соответствующем сервере.\n",
    "\n",
    "Абсолютная или относительная погрешность каждого из ответов не должна превышать 10−9."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "servers = []\n",
    "\n",
    "for _ in range(n):\n",
    "    a, b = map(int, input().split())\n",
    "    p = (a / 100) * (b / 100)\n",
    "    servers.append(p)\n",
    "\n",
    "total_probability = sum(servers)\n",
    "\n",
    "for server in servers:\n",
    "    print(round(server / total_probability, 12))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
