{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Пересадки\n",
    "\n",
    "На Новом проспекте для разгрузки было решено пустить два новых автобусных маршрута на разных участках проспекта.  Известны конечные остановки каждого из автобусов. Определите количество остановок, на  которых можно пересесть с одного автобуса на другой.\n",
    "\n",
    "Формат ввода  \n",
    "Вводятся четыре числа, не превосходящие 100, задающие номера конечных остановок. Сначала для первого, потом второго автобуса (см. примеры и рисунок).\n",
    "\n",
    "Формат вывода  \n",
    "Ваша программа должна выводить одно число – искомое количество остановок. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a, b, x, y = map(int, input().split())\n",
    "first = set([i for i in range(min(a,b),max(a,b)+1)])\n",
    "second = set([i for i in range(min(x,y), max(x,y)+1)])\n",
    "print(len(first & second))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
