{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Продажи\n",
    "\n",
    "Дана база данных о продажах некоторого интернет-магазина. Каждая строка входного файла представляет собой запись вида Покупатель товар количество, где Покупатель — имя покупателя (строка без пробелов), товар — название товара (строка без пробелов), количество — количество приобретенных единиц товара. Создайте список всех покупателей, а для каждого покупателя подсчитайте количество приобретенных им единиц каждого вида товаров.\n",
    "\n",
    "Формат ввода  \n",
    "Вводятся сведения о покупках в указанном формате.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите список всех покупателей в лексикографическом порядке, после имени каждого покупателя выведите двоеточие, затем выведите список названий всех приобретенных данным покупателем товаров в лексикографическом порядке, после названия каждого товара выведите количество единиц товара, приобретенных данным покупателем. Информация о каждом товаре выводится в отдельной строке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "file = open(\"input.txt\", \"r\", encoding='utf-8')\n",
    "x = file.readlines()\n",
    "result = {}\n",
    "for line in x:\n",
    "    man, good, g_count = line.split()\n",
    "    result.setdefault(man, {})\n",
    "    result[man][good] = result[man].get(good, 0) + int(g_count)\n",
    "\n",
    "for i in sorted(result.items()):\n",
    "    print(f'{i[0]}:')\n",
    "    for k in sorted(i[1].items()):\n",
    "        print(f'{k[0]} {k[1]}')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
