{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ограничение времени\t1.5 секунды  \n",
    "Ограничение памяти\t64Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Чтобы выбрать самый лучший алгоритм для решения задачи, Гоша продолжил изучать разные сортировки.\n",
    "\n",
    "Её алгоритм следующий (сортируем по неубыванию):\n",
    "\n",
    "На каждой итерации проходим по массиву, поочередно сравнивая пары соседних элементов. Если элемент на позиции i больше элемента на позиции i + 1, меняем их местами. После первой итерации самый большой элемент всплывёт в конце массива.  \n",
    "Проходим по массиву, выполняя указанные действия до тех пор, пока на очередной итерации не окажется, что обмены больше не нужны, то есть массив уже отсортирован.  \n",
    "После не более чем n – 1 итераций выполнение алгоритма заканчивается, так как на каждой итерации хотя бы один элемент оказывается на правильной позиции.  \n",
    "\n",
    "Помогите Гоше написать код алгоритма.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке на вход подаётся натуральное число n — длина массива, 2 ≤ n ≤ 1000.  \n",
    "Во второй строке через пробел записано n целых чисел.  \n",
    "Каждое из чисел по модулю не превосходит 1000.  \n",
    "\n",
    "Формат вывода  \n",
    "После каждого прохода по массиву, на котором какие-то элементы меняются местами, выводите его промежуточное состояние.  \n",
    "Таким образом, если сортировка завершена за k меняющих массив итераций, то надо вывести k строк по n чисел в каждой — элементы массива после каждой из итераций.  \n",
    "Если массив был изначально отсортирован, то просто выведите его."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def bubble(array, array_len):\n",
    "    sorted = False\n",
    "    for j in range(array_len-1):\n",
    "        F = 0\n",
    "        for i in range(array_len-1-j):\n",
    "            if array[i] > array[i+1]:\n",
    "                array[i], array[i+1] = array[i+1], array[i]\n",
    "                F = 1\n",
    "                if not sorted:\n",
    "                    sorted = True\n",
    "        if F == 1:\n",
    "            print(*array)\n",
    "    if not sorted:\n",
    "        print(*array)\n",
    "\n",
    "\n",
    "array_len = int(input())\n",
    "array = list(map(int, input().split()))\n",
    "\n",
    "bubble(array, array_len)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
