{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Разноцветные палочки\n",
    "\n",
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t256Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Есть 10 вертикальных палочек, пронумерованных от 0 до 9 и n колец трёх цветов красного «R», зеленого «G» и голубого «B», которые на надеты на палочки. Ваша задача по строке s, кодирующей, где находится каждое из колец определить количество палочек, на которое надеты кольца всех трёх цветов. Строка представляет из себя последовательность чётной длины, где на нечётных позициях (1, 3, 5 и т.д.) написан цвет кольца, а на чётных позициях (2, 4, 6 и т.д.) — номер палочки, на которую надето кольцо. Таким образом, кольцо номер i имеет цвет s2i−1 и находится на палочке номер s2i. Например, строка «R2G1R1B2G2» кодирует 5 колец:  \n",
    "\n",
    "Первое кольцо имеет красный цвет и находится на палочке 2;  \n",
    "Второе кольцо имеет зеленый цвет и находится на палочке 1;  \n",
    "Третье кольцо имеет красный цвет и находится на палочке 1;  \n",
    "Четвертое кольцо имеет синий цвет и находится на палочке 2;  \n",
    "Пятое кольцо имеет зеленый цвет и находится на палочке 2;  \n",
    "\n",
    "Формат ввода  \n",
    "Первая строка входных данных  — это непустая строка четной длины s (1≤|s|≤1000), состоящая из символов «R», «G» или «B» и цифр от 0 до 9.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите единственное целое число — количество палочек, на которых имеются кольца всех трёх цветов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "sticks = dict((i, set()) for i in range(10))\n",
    "\n",
    "data = list(input())\n",
    "\n",
    "for i in range(1, len(data), 2):\n",
    "    sticks[int(data[i])].add(data[i-1])\n",
    "\n",
    "answer = 0\n",
    "\n",
    "for i in sticks.items():\n",
    "    if len(i[1]) == 3:\n",
    "        answer += 1\n",
    "\n",
    "print(answer)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
