{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t64Mb  \n",
    "\n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Последовательность чисел назовем симметричной, если она одинаково читается как слева направо, так и справа налево. Например, следующие последовательности являются симметричными:  \n",
    "1 2 3 4 5 4 3 2 1  \n",
    "1 2 1 2 2 1 2 1  \n",
    "\n",
    "Вашей программе будет дана последовательность чисел. Требуется определить, какое минимальное количество и каких чисел надо приписать в конец этой последовательности, чтобы она стала симметричной.\n",
    "\n",
    "Формат ввода  \n",
    "Сначала вводится число N — количество элементов исходной последовательности (1 ≤ N ≤ 100). Далее идут N чисел — элементы этой последовательности, натуральные числа от 1 до 9.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите сначала число M — минимальное количество элементов, которое надо дописать к последовательности, а потом M чисел (каждое — от 1 до 9) — числа, которые надо дописать к последовательности."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "x = input()\n",
    "if x == x[::-1]:\n",
    "    print(0)\n",
    "else:\n",
    "    x = x.split()\n",
    "    for i in range(1,n):\n",
    "        check = x[i:]\n",
    "        if check == check[::-1]:\n",
    "            ans = x[:i][::-1]\n",
    "            print(len(ans))\n",
    "            print(*ans)\n",
    "            break"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.6"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "e688ee72b1c52c0fb07e5f21353202736868602701a19717d3e26524e4041c77"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
