{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Телефонные номера\n",
    "\n",
    "Телефонные номера в адресной книге мобильного телефона имеют один из следующих форматов: +7<код><номер>, 8<код><номер>, <номер>, где <номер> — это семь цифр, а <код> — это три цифры или три цифры в круглых скобках. Если код не указан, то считается, что он равен 495. Кроме того, в записи телефонного номера может стоять знак “-” между любыми двумя цифрами (см. пример). На данный момент в адресной книге телефона Васи записано всего три телефонных номера, и он хочет записать туда еще один. Но он не может понять, не записан ли уже такой номер в телефонной книге. Помогите ему! Два телефонных номера совпадают, если у них равны коды и равны номера. Например, +7(916)0123456 и 89160123456 — это один и тот же номер.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке входных данных записан номер телефона, который Вася хочет добавить в адресную книгу своего телефона. В следующих трех строках записаны три номера телефонов, которые уже находятся в адресной книге телефона Васи. Гарантируется, что каждая из записей соответствует одному из трех приведенных в условии форматов.\n",
    "\n",
    "Формат вывода  \n",
    "Для каждого телефонного номера в адресной книге выведите YES (заглавными буквами), если он совпадает с тем телефонным номером, который Вася хочет добавить в адресную книгу или NO (заглавными буквами) в противном случае."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "search = list(input().replace('-','').replace('(','').replace(')',''))\n",
    "if len(search) > 7:\n",
    "    if search[0] == '+':\n",
    "        search = search[2:]\n",
    "    elif search[0] == '8':\n",
    "        search = search[1:]\n",
    "elif len(search) == 7:\n",
    "    code = ['5', '9', '4']\n",
    "    for i in code:\n",
    "        search.insert(0, i)\n",
    "for i in range(3):\n",
    "    new = list(input().replace('-','').replace('(','').replace(')',''))\n",
    "    if len(new) > 7:\n",
    "        if new[0] == '+':\n",
    "            new = new[2:]\n",
    "        elif new[0] == '8':\n",
    "            new = new[1:]\n",
    "    elif len(new) == 7:\n",
    "        code = ['5', '9', '4']\n",
    "        for i in code:\n",
    "            new.insert(0, i)\n",
    "    if search == new:\n",
    "        print('YES')\n",
    "    else:\n",
    "        print('NO')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
