{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Угадай число\n",
    "\n",
    "Август и Беатриса играют в игру. Август загадал натуральное число от 1 до n. Беатриса пытается угадать это число, для этого она называет некоторые множества натуральных чисел. Август отвечает Беатрисе YES, если среди названных ей чисел есть задуманное или NO в противном случае. После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы она задавала и какие ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.\n",
    "\n",
    "Формат ввода  \n",
    "Первая строка входных данных содержит число n — наибольшее число, которое мог загадать Август. Далее идут строки, содержащие вопросы Беатрисы. Каждая строка представляет собой набор чисел, разделенных пробелами. После каждой строки с вопросом идет ответ Августа: YES или NO. Наконец, последняя строка входных данных содержит одно слово HELP.\n",
    "\n",
    "Формат вывода  \n",
    "Вы должны вывести (через пробел, в порядке возрастания) все числа, которые мог задумать Август."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "file = open(\"input.txt\", \"r\", encoding='utf-8')\n",
    "x = file.readlines()\n",
    "max_int = int(x[0])\n",
    "result = set(range(1, max_int+1))\n",
    "for line in range(1, len(x)+1,2):\n",
    "    if x[line].strip() == 'HELP':\n",
    "        break\n",
    "    else:\n",
    "        y = set(filter(lambda x: x <= max_int, map(int, x[line].split())))\n",
    "        if x[line+1].strip() == 'YES':\n",
    "            result &= y\n",
    "        else:\n",
    "            result -= y\n",
    "\n",
    "print(*sorted(result))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
