{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Утилита paste\n",
    "\n",
    "Ограничение времени\t1 секунда  \n",
    "Ограничение памяти\t64Mb  \n",
    "Ввод\tстандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Вам необходимо реализовать упрощенный аналог консольной утилиты paste. В Linux эта утилита принимает на вход несколько файлов и выписывает очередные строки этих файлов, склеенные через знак табуляции. В этой задаче отдельных входных файлов не будет: вместо этого данные будут просто последовательно подаваться на вход программы.\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке указано неотрицательное целое M — количество \"файлов\". Далее идёт M блоков данных. В начале каждого блока сначала указано неотрицательное целое число Ni — количество строк очередного \"файла\". Затем идут сами строки, состоящие из латинских букв, цифр и знаков пунктуации, но не содержащие пробельных разделителей (то есть, вы можете их читать просто через std::cin >> word). Гарантируется, что строки непусты. Количество файлов, количество строк в каждом файле и количество символов в каждой строке не превосходит 100.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите сначала первые строки всех файлов (склеив их через табуляцию), затем вторые строки и т. д. В конце каждой строки должен быть напечатан символ перевода строки. Если в каком-то из файлов строки закончатся раньше, не выводите в соответствующем поле ничего (но символ табуляции перед таким полем, если оно не первое, всё равно должен быть)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from itertools import zip_longest\n",
    "\n",
    "n = int(input())\n",
    "result = []\n",
    "\n",
    "for i in range(1,n+1):\n",
    "    m = int(input())\n",
    "    element = []\n",
    "    for k in range(m):\n",
    "        element.append(input())\n",
    "    result.append(element)\n",
    "\n",
    "for i in list(zip_longest(*result, fillvalue='')):\n",
    "    print(*i, sep='\\t')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
