{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Форматирование календаря\n",
    "\n",
    "Для отрисовки календаря в студенческом проекте было решено выделить функциональность форматирования в отдельный модуль.\n",
    "\n",
    "Параметрами модуля (формально для функции, которую можно будет импортировать из модуля) будут количество дней в месяце и название дня недели, на который приходится первое число месяца, записанное на английском языке.\n",
    "\n",
    "Выведите все дни месяца по неделям, дополнив первую неделю пустыми значениями, если это требуется.\n",
    "\n",
    "Формат ввода  \n",
    "В единственной строке входных данных записаны две величины:\n",
    "количество дней в месяце, день недели, на который приходится первое число месяца.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите k строк (4 ≤ k ≤ 6), в i-й строке выведите даты, которые попадают на i-ю неделю месяца.\n",
    "\n",
    "При выводе следуйте следующим правилам:  \n",
    "все строки, кроме последней, должны долны иметь ровно 7 элементов (в последней строке также может оказаться 7 элементов);\n",
    "при выводе дней с номерами от 1 до 9 следует добавить символ точки (.) перед цифрой;\n",
    "при выводе дней первой недели перед первым числом используйте две точки (..)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def make_calendar(days, day_of_week):\n",
    "    week = {\n",
    "        'Monday': 0,\n",
    "        'Tuesday': 1,\n",
    "        'Wednesday': 2,\n",
    "        'Thursday': 3,\n",
    "        'Friday': 4,\n",
    "        'Saturday': 5,\n",
    "        'Sunday': 6,\n",
    "    }\n",
    "    start_day = week[day_of_week]\n",
    "    elems = start_day + days\n",
    "    lines = elems//7 + bool(elems%7)\n",
    "    calendar = [['..']*7 for _ in range(lines)]\n",
    "\n",
    "    for i in range(1, days+1):\n",
    "        index = start_day + i - 1\n",
    "        if i < 10:\n",
    "            calendar[index//7][index%7] = f'.{i}'\n",
    "        else:\n",
    "            calendar[index//7][index%7] = f'{i}'\n",
    "\n",
    "    while '..' in calendar[-1]:\n",
    "        calendar[-1].pop()\n",
    "\n",
    "    return calendar\n",
    "   \n",
    "if __name__ == '__main__':\n",
    "    x = input().split()\n",
    "    days = int(x[0])\n",
    "    day_of_week = x[1]\n",
    "\n",
    "    for i in make_calendar(days, day_of_week):\n",
    "        print(' '.join(i))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
