{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Частотный анализ\n",
    "\n",
    "Дан текст. Выведите все слова, встречающиеся в тексте, по одному на каждую строку. Слова должны быть отсортированы по убыванию их количества появления в тексте, а при одинаковой частоте появления — в лексикографическом порядке. Указание. После того, как вы создадите словарь всех слов, вам захочется отсортировать его по частоте встречаемости слова. Желаемого можно добиться, если создать список, элементами которого будут кортежи из двух элементов: частота встречаемости слова и само слово. Например, [(2, 'hi'), (1, 'what'), (3, 'is')]. Тогда стандартная сортировка будет сортировать список кортежей, при этом кортежи сравниваются по первому элементу, а если они равны — то по второму. Это почти то, что требуется в задаче.\n",
    "\n",
    "Формат ввода  \n",
    "Вводится текст.\n",
    "\n",
    "Формат вывода  \n",
    "Выведите ответ на задачу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "file = open(\"input.txt\", \"r\", encoding='utf-8')\n",
    "x = file.readlines()\n",
    "\n",
    "result = {}\n",
    "\n",
    "for line in x:\n",
    "    y = line.split()\n",
    "    for k in y:\n",
    "        result[k] = result.get(k, 0) + 1\n",
    "items_d = [(v,k) for k,v in result.items()]\n",
    "items_d.sort(key=lambda x: (-x[0], x[1]))\n",
    "\n",
    "for i in items_d:\n",
    "    print(i[1])"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
