{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ограничение времени 3 секунды  \n",
    "Ограничение памяти\t64Mb  \n",
    "\n",
    "Ввод стандартный ввод или input.txt  \n",
    "Вывод\tстандартный вывод или output.txt  \n",
    "\n",
    "Тимофей решил организовать соревнование по спортивному программированию, чтобы найти талантливых стажёров. Задачи подобраны, участники зарегистрированы, тесты написаны. Осталось придумать, как в конце соревнования будет определяться победитель.\n",
    "\n",
    "Каждый участник имеет уникальный логин. Когда соревнование закончится, к нему будут привязаны два показателя: количество решённых задач Pi и размер штрафа Fi. Штраф начисляется за неудачные попытки и время, затраченное на задачу.\n",
    "\n",
    "Тимофей решил сортировать таблицу результатов следующим образом: при сравнении двух участников выше будет идти тот, у которого решено больше задач. При равенстве числа решённых задач первым идёт участник с меньшим штрафом. Если же и штрафы совпадают, то первым будет тот, у которого логин идёт раньше в алфавитном (лексикографическом) порядке.\n",
    "\n",
    "Тимофей заказал толстовки для победителей и накануне поехал за ними в магазин. В своё отсутствие он поручил вам реализовать алгоритм быстрой сортировки (англ. quick sort) для таблицы результатов. Так как Тимофей любит спортивное программирование и не любит зря расходовать оперативную память, то ваша реализация сортировки не может потреблять O(n) дополнительной памяти для промежуточных данных (такая модификация быстрой сортировки называется \"in-place\").\n",
    "\n",
    "Формат ввода  \n",
    "В первой строке задано число участников n, 1 ≤ n ≤ 100 000.\n",
    "В каждой из следующих n строк задана информация про одного из участников.\n",
    "i-й участник описывается тремя параметрами:\n",
    "- уникальным логином (строкой из маленьких латинских букв длиной не более 20)\n",
    "- числом решённых задач Pi\n",
    "- штрафом Fi\n",
    "\n",
    "Fi и Pi — целые числа, лежащие в диапазоне от 0 до 109.\n",
    "\n",
    "Формат вывода  \n",
    "Для отсортированного списка участников выведите по порядку их логины по одному в строке."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import List, Optional\n",
    "\n",
    "\n",
    "class Player:\n",
    "    \"\"\"Класс для участников соревнования.\"\"\"\n",
    "\n",
    "    def __init__(self, login: str, task: str, penalty: str):\n",
    "        self.login = login\n",
    "        self.task = int(task)\n",
    "        self.penalty = int(penalty)\n",
    "\n",
    "    def __lt__(self, another: 'Player') -> bool:\n",
    "        \"\"\"Сравненение элементов знаком 'меньше'\n",
    "        В первую очередь сравнивает по задачам,\n",
    "        потом по штрафу, в конце по логину.\"\"\"\n",
    "        return (-self.task, self.penalty, self.login) < \\\n",
    "               (-another.task, another.penalty, another.login)\n",
    "\n",
    "    def __str__(self) -> str:\n",
    "        \"\"\"Строковое отображение для вывода ответа.\"\"\"\n",
    "        return self.login\n",
    "\n",
    "\n",
    "def partition(array: List[Player], start: int, end: int) -> int:\n",
    "    \"\"\"Разделение массива и перестановка элементов in-place.\"\"\"\n",
    "\n",
    "    count = start - 1\n",
    "    pivot = array[end]\n",
    "    step = start\n",
    "    while step < end:\n",
    "        if array[step] < pivot:\n",
    "            count += 1\n",
    "            array[count], array[step] = array[step], array[count]\n",
    "        step += 1\n",
    "    array[count + 1], array[end] = array[end], array[count + 1]\n",
    "    return count + 1\n",
    "\n",
    "\n",
    "def quicksort(array: List[Player], start: int = 0,\n",
    "              end: Optional[int] = None) -> None:\n",
    "    \"\"\"Быстрая сортировка массива.\"\"\"\n",
    "    if end is None:\n",
    "        end = len(array) - 1\n",
    "    if start > end:\n",
    "        return\n",
    "    pivot_ind = partition(array, start, end)\n",
    "    quicksort(array, start, pivot_ind - 1)\n",
    "    quicksort(array, pivot_ind + 1, end)\n",
    "\n",
    "\n",
    "if __name__ == '__main__':\n",
    "    players_count = int(input())\n",
    "    players = []\n",
    "\n",
    "    for _ in range(players_count):\n",
    "        players.append(Player(*input().split()))\n",
    "\n",
    "    quicksort(players)\n",
    "    print(*players, sep='\\n')"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
